# BendDiameterTooLarge Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..BendDiameterTooLarge Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Bend Diameter is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BendDiameterTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendDiameterTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BendDiameterTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace